#+TITLE: Tianshuo's emacs setup
#+OPTIONS: toc:4
#+PROPERTY: header-args :tangle ~/.emacs.d/emacs_config.el :comments org
#+STARTUP: overview

** F2 to create terminal
#+BEGIN_SRC emacs-lisp
  (defconfig f2-create-term-buffer t
    (with-eval-after-load "compile"
      (require 'ansi-color)
      (defun colorize-compilation-buffer ()
        (ansi-color-apply-on-region (point-min) (point-max)))
      (add-hook 'compilation-filter-hook 'colorize-compilation-buffer)
      (setq compilation-scroll-output t)
      )

    ;;disable hl mode for terminal
    (add-hook 'term-mode-hook (lambda ()
                                (setq-local global-hl-line-mode
                                            nil)))

    (defadvice ansi-term (after advice-term-line-mode activate)
      (visual-line-mode -1) ;; avoid weird line wrapping issue
      (goto-address-mode) ;; make link clickable
      (yas-minor-mode -1) ;; tab expansion of yas could mess up the terminal, see https://github.com/joaotavora/yasnippet/issues/289
      )


    (defun visit-ansi-term ()
      "If the current buffer is:
    1) a running ansi-term named *ansi-term*, rename it.
    2) a stopped ansi-term, kill it and create a new one.
    3) a non ansi-term, go to an already running ansi-term
       or start a new one while killing a defunt one"
      (interactive)
      (require 'term)
      (let ((is-term (string= "term-mode" major-mode))
            (is-running (term-check-proc (buffer-name)))
            (term-cmd "/bin/zsh")
            (anon-term (get-buffer "*ansi-term*")))
        (if is-term
            (if is-running
                (if (string= "*ansi-term*" (buffer-name))
                    (call-interactively 'rename-buffer)
                  (if anon-term
                      (switch-to-buffer "*ansi-term*")
                    (ansi-term term-cmd)))
              (kill-buffer (buffer-name))
              (ansi-term term-cmd))
          (if anon-term
              (if (term-check-proc "*ansi-term*")
                  (switch-to-buffer "*ansi-term*")
                (kill-buffer "*ansi-term*")
                (ansi-term term-cmd))
            (ansi-term term-cmd)))))
    (global-set-key (kbd "<f2>") 'visit-ansi-term)
    )
#+END_SRC

#+RESULTS:
| org-persist-load-all | tramp-register-archive-autoload-file-name-handler | (lambda nil (if mc-use-melpa-packages (progn (if mc-use-melpa-packages (progn (setq package-archives '((GNU ELPA . https://elpa.gnu.org/packages/) (MELPA Stable . https://stable.melpa.org/packages/) (MELPA . https://melpa.org/packages/))) (setq package-archive-priorities '((MELPA Stable . 10) (GNU ELPA . 5) (MELPA . 0))))) (package-initialize)))) | (lambda nil (if literate-programming-in-org (progn (progn (defvar use-package--warning0 #'(lambda (keyword err) (let ((msg (format %s/%s: %s 'org keyword (error-message-string err)))) (display-warning 'use-package msg :error)))) (condition-case err (if (not (require 'org nil t)) (display-warning 'use-package (format Cannot load %s 'org) :error) (condition-case err (progn (progn (setq org-confirm-babel-evaluate nil) (setq org-src-fontify-natively t) (setq org-src-tab-acts-natively t)) (org-babel-do-load-languages 'org-babel-load-languages '((emacs-lisp . t) (sql . t))) t) ((debug error) (funcall use-package--warning0 :config err)))) ((debug error) (funcall use-package--warning0 :catch err))))))) | (lambda nil (if basic-term-config (progn (eval-after-load term #'(lambda nil (xterm-mouse-mode 1) (define-key term-raw-map (kbd C-c C-y) 'term-paste)))))) | (lambda nil (if f2-create-term-buffer (progn (eval-after-load compile #'(lambda nil (require 'ansi-color) (defalias 'colorize-compilation-buffer #'(lambda nil (ansi-color-apply-on-region (point-min) (point-max)))) (add-hook 'compilation-filter-hook 'colorize-compilation-buffer) (setq compilation-scroll-output t))) (add-hook 'term-mode-hook #'(lambda nil (set (make-local-variable 'global-hl-line-mode) nil))) (progn (ad-add-advice 'ansi-term '(advice-term-line-mode nil t (advice lambda nil (visual-line-mode -1) (goto-address-mode) (yas-minor-mode -1))) 'after 'nil) (ad-activate 'ansi-term nil) 'ansi-term) (defalias 'visit-ansi-term #'(lambda nil If the current buffer is: |

* Basic Emacs Config
#+BEGIN_SRC emacs-lisp
  (defconfig disable-startup-screen t
    (setq inhibit-startup-screen t)
    )

  (defconfig enable-mouse t
    (xterm-mouse-mode 1)
    )

  (defconfig mac-emacs-use-ls-emulation t
    (when (string= system-type "darwin")
      (setq ls-lisp-use-insert-directory-program nil)
      (require 'ls-lisp)
      ))

  (defconfig temp-file-to-temp-dir t
    (setq backup-directory-alist
          `((".*" . ,temporary-file-directory)))
    (setq auto-save-file-name-transforms
          `((".*" ,temporary-file-directory t)))
    ;; fix 'controll path too long' issue when using tramp
    (setenv "TMPDIR" "/tmp")
    )

  (defconfig buffer-file-auto-sync t
    (global-auto-revert-mode t)
    (global-set-key (kbd "<f5>") 'revert-buffer)
    )

  (defconfig auto-copy-paste-between-os-and-emacs t
    "Use either osc52, xclip or osx-clipboard."
    (defun clip-use-osx ()
      "Copy to osx's clipboard directly, this is useful for osx's terminal \
               which does not support osc52"
      (interactive)
      (use-package osx-clipboard
        :config
        (osx-clipboard-mode +1)
        (message "osx-clippboard enabled!!!"
        ))
      )

    (defun clip-use-xclip ()
      "Copy to linux's paste board directly with xclip, need to make sure xclip \
               is installed on the system.  This is useful only when using gnome-terminal \
               which does not support osc52"
      (interactive)
      (use-package xclip
        :config
        (xclip-mode)
        ))

    (defun in-ssh ()
      (interactive)
      "if I'm in ssh"
      (or (not (null (getenv "SSH_TTY"))) (not (null (getenv "TMUX")))
      ))

    (defun clip-use-osc52 ()
      "Use osc52 to paste, should support remote terminal, even within tmux.  In \
               unsupported terminals, e.g. gnome-terminal, enabling this will cause weird \
               escape characters being displayed on the screen"
      (interactive)
      (require 'osc52e)
      (osc52-set-cut-function))

    ;; OSX
    (if (string-equal system-type "darwin")
        (clip-use-osx))
    ;; Linux
    (if (string-equal system-type "gnu/linux")
        (if (in-ssh)
            (clip-use-osc52)
          (clip-use-xclip))
      )
    )

  (defconfig copy-url-when-clicked t
    (defun url-to-pasteboard (url &rest args)
      (message "pasteboard < %s" url)
      (kill-new url)
      )

    (defun browse-to-cut ()
      "Cut to clipboard when clicking on a link"
      (interactive)
      (setq browse-url-browser-function 'url-to-pasteboard)
      )

    (defun browse-to-open ()
      "revert browse-to-cut"
      (interactive)
      (setq browse-url-browser-function 'browse-url-default-browser)
      )
    (browse-to-cut)
    )

  (defconfig scroll-with-arrow-keys t
    (global-set-key [up] (lambda () (interactive) (scroll-down 1)))
    (global-set-key [down] (lambda () (interactive) (scroll-up 1)))
    )

  (defconfig fix-shell-path-in-gui-emacs t
    "Fix PATH when executing a shell command from GUI emacs"
    (use-package exec-path-from-shell
      :if (memq window-system '(mac ns))
      :config
      (exec-path-from-shell-initialize)
      )
    )

  (defconfig use-recent-files-buffer t
    (with-eval-after-load 'recentf
      (recentf-mode t) ;; enable recent files mode. it's autoloaded function.
      (setq recentf-max-saved-items 10)
      )
    )

  (defconfig gui-hide-toolbar-scrollbar t
    (setq-default frame-title-format "%b (%f)")
    (if window-system (progn
                        (tool-bar-mode -1)
                        (scroll-bar-mode -1)
                        ))
    )

  (defconfig hide-menu-bar t
    (menu-bar-mode 0)
    )

  (defconfig remember-last-open-location t
    (save-place-mode 1)
    )

  (defconfig no-tabs t
    (setq-default indent-tabs-mode nil))

  (defconfig show-matching-parens t
    (show-paren-mode 1) ;; show matching paren
    (defadvice show-paren-function
        (after show-matching-paren-offscreen activate)
      "If the matching paren is offscreen, show the matching line in the
        echo area. Has no effect if the character before point is not of
        the syntax class."
      (interactive)
      (let* ((cb (char-before (point)))
             (matching-text (and cb
                                 (char-equal (char-syntax cb) ?\})
                                 (blink-matching-open))))
        (when matching-text (message matching-text))))
    )

  (defconfig auto-indent-and-pair-parens t
    (electric-indent-mode +1)
    (electric-pair-mode +1)
    )

  (defconfig avoid-screen-flickering-when-recenter t
    "Borrowed from: https://emacs.stackexchange.com/questions/47091/stop-emacs-from-redrawing-display"
    (setq recenter-redisplay nil)
    )

  (defconfig expand-region t
     (use-package expand-region
       :ensure t
       :bind (("C-]" . er/expand-region))
       )
    )

  (defconfig use-writeroom t
     (use-package writeroom-mode
       :ensure t
       :bind ("C-x RET" . writeroom-mode)
       :config
       (setq writeroom-restore-window-config t)
       )
    )

  (defconfig C-c-for-caps-lock t
     (use-package caps-lock
       :ensure t
       :bind ("C-x c" . caps-lock-mode)
       )
    )

  (defconfig fill-column-80 t
    "Some discussions:
     - https://hackernoon.com/does-column-width-of-80-make-sense-in-2018-50c161fbdcf6
     - https://stackoverflow.com/questions/578059/studies-on-optimal-code-width"
    (setq-default fill-column 80)
    )
#+END_SRC

#+RESULTS:
| tramp-register-archive-file-name-handler | (lambda nil (if mc-use-melpa-packages (progn (if mc-use-melpa-packages (setq package-archives '((GNU ELPA . https://elpa.gnu.org/packages/) (MELPA Stable . https://stable.melpa.org/packages/) (MELPA . https://melpa.org/packages/)) package-archive-priorities '((MELPA Stable . 10) (GNU ELPA . 5) (MELPA . 0)))) (package-initialize)))) | (lambda nil (if literate-programming-in-org (progn (eval-after-load 'org #'(lambda nil (setq org-confirm-babel-evaluate nil org-src-fontify-natively t org-src-tab-acts-natively t) (org-babel-do-load-languages 'org-babel-load-languages '((emacs-lisp . t) (sql . t)))))))) | (lambda nil (if basic-term-config (progn (eval-after-load term #'(lambda nil (xterm-mouse-mode 1) (define-key term-raw-map (kbd C-c C-y) 'term-paste)))))) | (lambda nil (if f2-create-term-buffer (progn (eval-after-load compile #'(lambda nil (require 'ansi-color) (defalias 'colorize-compilation-buffer #'(lambda nil (toggle-read-only) (ansi-color-apply-on-region (point-min) (point-max)) (toggle-read-only))) (add-hook 'compilation-filter-hook 'colorize-compilation-buffer) (setq compilation-scroll-output t))) (add-hook 'term-mode-hook #'(lambda nil (set (make-local-variable 'global-hl-line-mode) nil))) (progn (ad-add-advice 'ansi-term '(advice-term-line-mode nil t (advice lambda nil (visual-line-mode -1) (goto-address-mode) (yas-minor-mode -1))) 'after 'nil) (ad-activate 'ansi-term nil) 'ansi-term) (defalias 'visit-ansi-term #'(lambda nil If the current buffer is: |

